In [1]:
import pandas as pd
df1 =  pd.DataFrame({'Alumnos': ['Agus', 'Nico', 'Martu', 'Nicole', 'Fer', 'Pilar'], 'Comision': ['B0', 'B1','B2' ,'B3','B1' ,'B0'], 'Carrera': ['ND', 'LNE', 'LINF', 'LMKT', 'ND', 'ND']})
df1

  Alumnos Comision Carrera
0    Agus       B0      ND
1    Nico       B1     LNE
2   Martu       B2    LINF
3  Nicole       B3    LMKT
4     Fer       B1      ND
5   Pilar       B0      ND

In [2]:
df2 =  pd.DataFrame({'Alumnos': ['Agus', 'Nico', 'Martu', 'Nicole', 'Fer', 'Pilar'], 'Anio': [1,3,2,4,2,1]})
df2

  Alumnos  Anio
0    Agus     1
1    Nico     3
2   Martu     2
3  Nicole     4
4     Fer     2
5   Pilar     1

In [3]:
pd.concat([df1, df2], join='inner')

  Alumnos
0    Agus
1    Nico
2   Martu
3  Nicole
4     Fer
5   Pilar
0    Agus
1    Nico
2   Martu
3  Nicole
4     Fer
5   Pilar

In [4]:
df2 =  pd.DataFrame({'Alumnos': ['Pilar', 'Martu', 'Nico', 'Nicole', 'Fer', 'Agus'], 'Anio': [1,2,3,4,2,1],})
df2

  Alumnos  Anio
0   Pilar     1
1   Martu     2
2    Nico     3
3  Nicole     4
4     Fer     2
5    Agus     1

In [5]:
pd.merge(df1, df2, on="Alumnos")

  Alumnos Comision Carrera  Anio
0    Agus       B0      ND     1
1    Nico       B1     LNE     3
2   Martu       B2    LINF     2
3  Nicole       B3    LMKT     4
4     Fer       B1      ND     2
5   Pilar       B0      ND     1